app/controllers/dustbins_controller.rb

	def show
        ds = Dustbin.all().limit(20).pluck(:location, :filled_level, :temperature, :health)
---
SELECT  "dustbins"."location", "dustbins"."filled_level", "dustbins"."temperature", "dustbins"."health" FROM "dustbins" ORDER BY "dustbins"."updated_at" DESC LIMIT $1  [["LIMIT", 20]]